test/minikube-overheads/results/aqua-db/postgres-default-sysbench
sysbench 1.0.20 (using system LuaJIT 2.1.1720049189)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            44142
        write:                           12612
        other:                           6306
        total:                           63060
    transactions:                        3153   (315.20 per sec.)
    queries:                             63060  (6303.97 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0028s
    total number of events:              3153

Latency (ms):
         min:                                    2.47
         avg:                                    3.17
         max:                                   17.40
         99th percentile:                        9.73
         sum:                                10001.06

Threads fairness:
    events (avg/stddev):           3153.0000/0.00
    execution time (avg/stddev):   10.0011/0.00