test/minikube-overheads/results/aqua-db/postgres-qemu-sysbench
sysbench 1.0.20 (using system LuaJIT 2.1.1720049189)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            35490
        write:                           10140
        other:                           5070
        total:                           50700
    transactions:                        2535   (253.44 per sec.)
    queries:                             50700  (5068.74 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0019s
    total number of events:              2535

Latency (ms):
         min:                                    3.09
         avg:                                    3.94
         max:                                    7.89
         99th percentile:                        5.18
         sum:                                10000.08

Threads fairness:
    events (avg/stddev):           2535.0000/0.00
    execution time (avg/stddev):   10.0001/0.00